MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_usb.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_usb__include
#define ti_devices_msp_peripherals_hw_usb__include

/* Filename: hw_usb.h */
/* Revised: 2024-10-17 19:02:43 */
/* Revision: 57ee25d5f5e8d3be5c1a7d5449fc2e7ef36548c9 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* USB Registers
******************************************************************************/
#define USB_CSR_OFS                              ((uint32_t)0x00002110U)
#define USB_TADDR_OFS                            ((uint32_t)0x00002080U)
#define USB_REGISTERS_OFS                        ((uint32_t)0x00002000U)
#define USB_CPU_INT_OFS                          ((uint32_t)0x00001020U)
#define USB_GPRCM_OFS                            ((uint32_t)0x00000800U)


/** @addtogroup USB_CSR
  @{
*/

typedef struct {
  __IO uint16_t TXMAXP;                            /* !< (@ 0x00002110) USB Maximum Transmit Data Endpoint [n] */
  __IO uint8_t TXCSRL;                            /* !< (@ 0x00002112) USB Transmit Control and Status Endpoint [n] Low */
  __IO uint8_t TXCSRH;                            /* !< (@ 0x00002113) USB Transmit Control and Status Endpoint [n] High */
  __IO uint16_t RXMAXP;                            /* !< (@ 0x00002114) USB Maximum Receive Data Endpoint [n] */
  __IO uint8_t RXCSRL;                            /* !< (@ 0x00002116) USB Receive Control and Status Endpoint [n] Low */
  __IO uint8_t RXCSRH;                            /* !< (@ 0x00002117) USB Receive Control and Status Endpoint [n] High */
  __IO uint16_t RXCOUNT;                           /* !< (@ 0x00002118) USB Receive Byte Count Endpoint [n] */
  __IO uint8_t TXTYPE;                            /* !< (@ 0x0000211A) USB Host Transmit Configure Type Endpoint [n] */
  __IO uint8_t TXINTERVAL;                        /* !< (@ 0x0000211B) USB Host Transmit Interval Endpoint [n] */
  __IO uint8_t RXTYPE;                            /* !< (@ 0x0000211C) USB Host Configure Receive Type Endpoint [n] */
  __IO uint8_t RXINTERVAL;                        /* !< (@ 0x0000211D) USB Host Receive Polling Interval Endpoint [n] */
       uint8_t  RESERVED0;
  __I  uint8_t FIFOSZ;                            /* !< (@ 0x0000211F) USB TX and RX FIFO Size Endpoint [n] */
} USB_CSR_Regs;

/*@}*/ /* end of group USB_CSR */

/** @addtogroup USB_TADDR
  @{
*/

typedef struct {
  __IO uint8_t TXFUNCADDR;                        /* !< (@ 0x00002080) USB Transmit Functional Address Endpoint [n] */
       uint8_t  RESERVED0;
  __IO uint8_t TXHUBADDR;                         /* !< (@ 0x00002082) USB Transmit Hub Address Endpoint [n] */
  __IO uint8_t TXHUBPORT;                         /* !< (@ 0x00002083) USB Transmit Hub Port Endpoint [n] */
  __IO uint8_t RXFUNCADDR;                        /* !< (@ 0x00002084) USB Receive Functional Address Endpoint [n] */
       uint8_t  RESERVED1;
  __IO uint8_t RXHUBADDR;                         /* !< (@ 0x00002086) USB Receive Hub Address Endpoint [n] */
  __IO uint8_t RXHUBPORT;                         /* !< (@ 0x00002087) USB Receive Hub Port Endpoint [n] */
} USB_TADDR_Regs;

/*@}*/ /* end of group USB_TADDR */

/** @addtogroup USB_REGISTERS
  @{
*/

typedef struct {
  __IO uint8_t FADDR;                             /* !< (@ 0x00002000) USB Device Functional Address */
  __IO uint8_t POWER;                             /* !< (@ 0x00002001) USB Power Control */
  __I  uint16_t TXIS;                              /* !< (@ 0x00002002) USB Transmit Interrupt Status */
  __I  uint16_t RXIS;                              /* !< (@ 0x00002004) USB Receive Interrupt Status */
  __IO uint16_t TXIE;                              /* !< (@ 0x00002006) USB Transmit Interrupt Enable */
  __IO uint16_t RXIE;                              /* !< (@ 0x00002008) USB Receive Interrupt Enable */
  __IO uint8_t USBIS;                             /* !< (@ 0x0000200A) USB General Interrupt Status */
  __IO uint8_t USBIE;                             /* !< (@ 0x0000200B) USB General Interrupt Enable */
  __IO uint16_t FRAME;                             /* !< (@ 0x0000200C) USB Last Received Frame Number */
  __IO uint8_t EPINDEX;                           /* !< (@ 0x0000200E) USB Endpoint Index */
  __IO uint8_t TESTMODE;                          /* !< (@ 0x0000200F) USB Test Mode */
  __IO uint16_t IDXTXMAXP;                         /* !< (@ 0x00002010) Indexed TXMAP */
  __IO uint8_t IDXTXCSRL;                         /* !< (@ 0x00002012) Indexed TXCSRL */
  __IO uint8_t IDXTXCSRH;                         /* !< (@ 0x00002013) Indexed TXCSRH */
  __IO uint16_t IDXRXMAXP;                         /* !< (@ 0x00002014) Indexed RXMAXP */
  __IO uint8_t IDXRXCSRL;                         /* !< (@ 0x00002016) Indexed RXCSRL */
  __IO uint8_t IDXRXCSRH;                         /* !< (@ 0x00002017) Indexed RXCSRH */
  __IO uint16_t IDXRXCOUNT;                        /* !< (@ 0x00002018) Indexed RXCOUNT */
  __IO uint8_t IDXTXTYPE;                         /* !< (@ 0x0000201A) Indexed TXTYPE */
  __IO uint8_t IDXTXINTERVAL;                     /* !< (@ 0x0000201B) Indexed TXINTERVAL */
  __IO uint8_t IDXRXTYPE;                         /* !< (@ 0x0000201C) Indexed RXTYPE */
  __IO uint8_t IDXRXINTERVAL;                     /* !< (@ 0x0000201D) Indexed RXINTERVAL */
       uint8_t  RESERVED0;
  __IO uint8_t IDXFIFOSZ;                         /* !< (@ 0x0000201F) Indexed FIFOSZ */
  union {
      __IO uint32_t FIFO[16];                          /* !< USB FIFO Endpoint [n] */
      __IO uint8_t FIFO_BYTE[16];                     /* !< Byte access to FIFO for Endpoint [y]. */
      __IO uint16_t FIFO_HALF[16];                     /* !< Half word access to FIFO for Endpoint [y]. */
      __IO uint32_t FIFO_WORD[16];                     /* !< Word access to FIFO for Endpoint [y]. */
  };
  __IO uint8_t DEVCTL;                            /* !< (@ 0x00002060) USB Device Control */
  __IO uint8_t MISC;                              /* !< (@ 0x00002061) USB Miscellaneous Register */
  __IO uint8_t IDXTXFIFOSZ;                       /* !< (@ 0x00002062) Indexed USB Transmit Dynamic FIFO Sizing */
  __IO uint8_t IDXRXFIFOSZ;                       /* !< (@ 0x00002063) Indexed USB Receive Dynamic FIFO Sizing */
  __IO uint16_t IDXTXFIFOADD;                      /* !< (@ 0x00002064) Indexed USB Transmit FIFO Start Address */
  __IO uint16_t IDXRXFIFOADD;                      /* !< (@ 0x00002066) Indexed USB Receive FIFO Start Address */
       uint32_t RESERVED1[4];
  __I  uint8_t EPINFO;                            /* !< (@ 0x00002078) Endpoint Information */
  __I  uint8_t RAMINFO;                           /* !< (@ 0x00002079) USB FIFO Buffer RAM Information */
  __IO uint8_t CONTIM;                            /* !< (@ 0x0000207A) USB Connect Timing */
       uint8_t RESERVED2[2];
  __IO uint8_t FSEOF;                             /* !< (@ 0x0000207D) USB Full-Speed Last Transaction to End of Frame
                                                      Timing */
  __IO uint8_t LSEOF;                             /* !< (@ 0x0000207E) USB Low-Speed Last Transaction to End of Frame
                                                      Timing */
       uint8_t  RESERVED3;
  USB_TADDR_Regs  TADDR[16];                         /* !< (@ 0x00002080) */
       uint16_t RESERVED4;
  __IO uint8_t CSR0L;                             /* !< (@ 0x00002102) USB Control and Status Endpoint 0 Low */
  __IO uint8_t CSR0H;                             /* !< (@ 0x00002103) USB Control and Status Endpoint 0 High */
       uint32_t RESERVED5;
  __IO uint8_t COUNT0;                            /* !< (@ 0x00002108) USB Receive Byte Count Endpoint 0 */
       uint8_t  RESERVED6;
  __IO uint8_t TYPE0;                             /* !< (@ 0x0000210A) USB Type Endpoint 0 */
  __IO uint8_t NAKLMT0;                           /* !< (@ 0x0000210B) USB NAK Limit Endpoint 0 */
       uint8_t  RESERVED7[3];
  __I  uint8_t CONFIG;                            /* !< (@ 0x0000210F) USB Config Data */
  USB_CSR_Regs  CSR[15];                           /* !< (@ 0x00002110) */
       uint32_t RESERVED8[65];
  __IO uint32_t RQPKTCOUNT[15];                    /* !< (@ 0x00002304) USB Request Packet Count in Block Transfer
                                                      Endpoint [n] */
  __IO uint16_t RXDPKTBUFDIS;                      /* !< (@ 0x00002340) USB Receive Double Packet Buffer Disable */
  __IO uint16_t TXDPKTBUFDIS;                      /* !< (@ 0x00002342) USB Transmit Double Packet Buffer Disable */
} USB_REGISTERS_Regs;

