MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_usb.h
/* USB_TXCSRH Bits */
/* USB_TXCSRH[DT] Bits */
#define USB_TXCSRH_DT_OFS                        (0)                             /* !< DT Offset */
#define USB_TXCSRH_DT_MASK                       ((uint8_t)0x00000001U)          /* !< Data Toggle. When read, this bit
                                                                                    indicates the current state of the
                                                                                    transmit endpoint data toggle. If
                                                                                    DTWE is High, this bit can be written
                                                                                    with the required setting of the data
                                                                                    toggle. If DTWE is Low, any value
                                                                                    written to this bit is ignored. Care
                                                                                    should be taken when writing to this
                                                                                    bit as it should only be changed to
                                                                                    RESET the transmit endpoint. Note:
                                                                                    Host mode only */
#define USB_TXCSRH_DT_LOW                        ((uint8_t)0x00000000U)          /* !< Data toggle is low */
#define USB_TXCSRH_DT_HIGH                       ((uint8_t)0x00000001U)          /* !< Data toggle is high */
/* USB_TXCSRH[DTWE] Bits */
#define USB_TXCSRH_DTWE_OFS                      (1)                             /* !< DTWE Offset */
#define USB_TXCSRH_DTWE_MASK                     ((uint8_t)0x00000002U)          /* !< Data Toggle Write Enable.  The CPU
                                                                                    writes a 1 to this bit to enable the
                                                                                    current state of the TX Endpoint data
                                                                                    toggle to be written. This bit is
                                                                                    automatically cleared once the new
                                                                                    value is written. Note: Host mode
                                                                                    only. */
#define USB_TXCSRH_DTWE_DISABLE                  ((uint8_t)0x00000000U)          /* !< The DT bit cannot be written. */
#define USB_TXCSRH_DTWE_ENABLE                   ((uint8_t)0x00000002U)          /* !< Enables the current state of the
                                                                                    transmit endpoint data to be written
                                                                                    (see DT bit). */
/* USB_TXCSRH[DMAMOD] Bits */
#define USB_TXCSRH_DMAMOD_OFS                    (2)                             /* !< DMAMOD Offset */
#define USB_TXCSRH_DMAMOD_MASK                   ((uint8_t)0x00000004U)          /* !< DMA Request Mode. The CPU sets this
                                                                                    bit to select DMA Request Mode 1 and
                                                                                    clears it to select DMA Request Mode
                                                                                    0. Note: This bit must not be cleared
                                                                                    either before or in the same cycle as
                                                                                    the DMAEN bit is cleared. Note:
                                                                                    Device and host mode. */
#define USB_TXCSRH_DMAMOD_MODE0                  ((uint8_t)0x00000000U)          /* !< An interrupt is generated after
                                                                                    every DMA packet transfer. */
#define USB_TXCSRH_DMAMOD_MODE1                  ((uint8_t)0x00000004U)          /* !< An interrupt is generated only
                                                                                    after the entire DMA transfer is
                                                                                    complete. */
/* USB_TXCSRH[FDT] Bits */
#define USB_TXCSRH_FDT_OFS                       (3)                             /* !< FDT Offset */
#define USB_TXCSRH_FDT_MASK                      ((uint8_t)0x00000008U)          /* !< Force Data Toggle. The CPU sets
                                                                                    this bit to force the endpoint DT bit
                                                                                    to switch and the data packet to be
                                                                                    cleared from the FIFO, regardless of
                                                                                    whether an ACK was received. This can
                                                                                    be used by Interrupt TX endpoints
                                                                                    that are used to communicate rate
                                                                                    feedback for Isochronous endpoints.
                                                                                    Note: This bit should only be set
                                                                                    when the TXRDY bit is set. At other
                                                                                    times, it may cause data to be
                                                                                    corrupted. Note: Device and host
                                                                                    mode. */
#define USB_TXCSRH_FDT_NO_EFFECT                 ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_TXCSRH_FDT_EFFECT                    ((uint8_t)0x00000008U)          /* !< Forces data toggle */
/* USB_TXCSRH[DMAEN] Bits */
#define USB_TXCSRH_DMAEN_OFS                     (4)                             /* !< DMAEN Offset */
#define USB_TXCSRH_DMAEN_MASK                    ((uint8_t)0x00000010U)          /* !< DMA Request Enable The CPU sets
                                                                                    this bit to enable the DMA request
                                                                                    for the TX endpoint. Note: Four TX
                                                                                    and four RX endpoints can be
                                                                                    connected to the DMA module. If this
                                                                                    bit is set for a particular endpoint,
                                                                                    the TRIGATX, TRIGBTX, TRIGCTX, or
                                                                                    TRIGDTX field in the USB DMA Select
                                                                                    (USBDMASEL) register must be
                                                                                    programmed correspondingly. Note:
                                                                                    Device and host mode. */
#define USB_TXCSRH_DMAEN_DISABLE                 ((uint8_t)0x00000000U)          /* !< Disables the DMA request for the
                                                                                    transmit endpoint. */
#define USB_TXCSRH_DMAEN_ENABLE                  ((uint8_t)0x00000010U)          /* !< Enables the DMA request for the
                                                                                    transmit endpoint. */
/* USB_TXCSRH[MODE] Bits */
#define USB_TXCSRH_MODE_OFS                      (5)                             /* !< MODE Offset */
#define USB_TXCSRH_MODE_MASK                     ((uint8_t)0x00000020U)          /* !< Mode The CPU sets this bit to
                                                                                    enable the endpoint direction as TX,
                                                                                    and clears the bit to enable it as
                                                                                    Rx.  Note: This bit only has an
                                                                                    effect when the same endpoint FIFO is
                                                                                    used for both transmit and receive
                                                                                    transactions. Note: Host and device
                                                                                    mode. */
#define USB_TXCSRH_MODE_RX                       ((uint8_t)0x00000000U)          /* !< Enables the endpoint direction as
                                                                                    RX. */
#define USB_TXCSRH_MODE_TX                       ((uint8_t)0x00000020U)          /* !< Enables the endpoint direction as
                                                                                    TX. */
/* USB_TXCSRH[ISO] Bits */
#define USB_TXCSRH_ISO_OFS                       (6)                             /* !< ISO Offset */
#define USB_TXCSRH_ISO_MASK                      ((uint8_t)0x00000040U)          /* !< Isochronous Transfers. The CPU sets
                                                                                    this bit to enable the TX endpoint
                                                                                    for Isochronous transfers, and clears
                                                                                    it to enable the TX endpoint for Bulk
                                                                                    or Interrupt transfers.  Note: This
                                                                                    bit only has any effect in device
                                                                                    mode. In host mode, it always returns
                                                                                    zero. */
#define USB_TXCSRH_ISO_BULK_INT_TRANSFER         ((uint8_t)0x00000000U)          /* !< Enables the transmit endpoint for
                                                                                    bulk or interrupt transfers. */
#define USB_TXCSRH_ISO_ISO_TRANSFER              ((uint8_t)0x00000040U)          /* !< Enables the transmit endpoint for
                                                                                    isochronous transfers. */
/* USB_TXCSRH[AUTOSET] Bits */
#define USB_TXCSRH_AUTOSET_OFS                   (7)                             /* !< AUTOSET Offset */
#define USB_TXCSRH_AUTOSET_MASK                  ((uint8_t)0x00000080U)          /* !< Auto Set. If the CPU sets this bit,
                                                                                    the TXRDY bit will be be
                                                                                    automatically set when data of the
                                                                                    maximum packet size (value in
                                                                                    USBTXMAXP[n]) is loaded into the
                                                                                    transmit FIFO. If a packet of less
                                                                                    than the maximum packet size is
                                                                                    loaded, then the TXRDY bit must be
                                                                                    set manually. Note: Should not be set
                                                                                    for either high-bandwidth Isochronous
                                                                                    endpoints or high-bandwidth Interrupt
                                                                                    endpoints. Note: Device and host
                                                                                    mode. */
#define USB_TXCSRH_AUTOSET_MANUAL                ((uint8_t)0x00000000U)          /* !< The TXRDY bit must be set manually. */
#define USB_TXCSRH_AUTOSET_AUTO                  ((uint8_t)0x00000080U)          /* !< The TXRDY bit is automatically set
                                                                                    when maximum packet size is loaded
                                                                                    into the TX FIFO. */

/* USB_RXMAXP Bits */
/* USB_RXMAXP[MAXLOAD] Bits */
#define USB_RXMAXP_MAXLOAD_OFS                   (0)                             /* !< MAXLOAD Offset */
#define USB_RXMAXP_MAXLOAD_MASK                  ((uint16_t)0x000007FFU)         /* !< Maximum Payload specifies the
                                                                                    maximum payload in bytes per
                                                                                    transaction. */

