MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_usb.h
/* USB_RXCSRL Bits */
/* USB_RXCSRL[RXRDY] Bits */
#define USB_RXCSRL_RXRDY_OFS                     (0)                             /* !< RXRDY Offset */
#define USB_RXCSRL_RXRDY_MASK                    ((uint8_t)0x00000001U)          /* !< Receive Packet Ready. This bit is
                                                                                    set when a data packet has been
                                                                                    received. The CPU should clear this
                                                                                    bit when the packet has been unloaded
                                                                                    from the Rx FIFO. An interrupt is
                                                                                    generated when the bit is set. If the
                                                                                    AUTOCLR bit in the USBRXCSRH[n]
                                                                                    register is set, then the this bit is
                                                                                    automatically cleared when a packet
                                                                                    of USBRXMAXP[n] bytes has been
                                                                                    unloaded from the receive FIFO. If
                                                                                    the AUTOCLR bit is clear, or if
                                                                                    packets of less than the maximum
                                                                                    packet size are unloaded, then
                                                                                    software must clear this bit manually
                                                                                    when the packet has been unloaded
                                                                                    from the receive FIFO. Note: Device
                                                                                    and host mode. */
#define USB_RXCSRL_RXRDY_WAIT                    ((uint8_t)0x00000000U)          /* !< No data packet has been received. */
#define USB_RXCSRL_RXRDY_READY                   ((uint8_t)0x00000001U)          /* !< Indicates that a data packet has
                                                                                    been received. The EP[j] bit in the
                                                                                    USBTXIS register is also set in this
                                                                                    situation */
/* USB_RXCSRL[FULL] Bits */
#define USB_RXCSRL_FULL_OFS                      (1)                             /* !< FULL Offset */
#define USB_RXCSRL_FULL_MASK                     ((uint8_t)0x00000002U)          /* !< FIFO Full. This bit is set when no
                                                                                    more packets can be loaded into the
                                                                                    RX FIFO. Note: Device and host mode. */
#define USB_RXCSRL_FULL_NO                       ((uint8_t)0x00000000U)          /* !< The receive FIFO is not full. */
#define USB_RXCSRL_FULL_YES                      ((uint8_t)0x00000002U)          /* !< The receive FIFO is full. No more
                                                                                    packets can be loaded into the
                                                                                    receive FIFO. */
/* USB_RXCSRL[OVERERROR] Bits */
#define USB_RXCSRL_OVERERROR_OFS                 (2)                             /* !< OVERERROR Offset */
#define USB_RXCSRL_OVERERROR_MASK                ((uint8_t)0x00000004U)          /* !< Over run / Error. Device mode: Over
                                                                                    run - This bit is set if an OUT
                                                                                    packet cannot be loaded into the
                                                                                    receive FIFO. The CPU should clear
                                                                                    this bit. - Note: This bit is only
                                                                                    valid when the endpoint is operating
                                                                                    in ISO mode. In Bulk mode, it always
                                                                                    returns zero. Host mode: The USB sets
                                                                                    this bit when 3 attempts have been
                                                                                    made to receive a packet and no data
                                                                                    packet has been received. The CPU
                                                                                    should clear this bit. An interrupt
                                                                                    is generated when the bit is set. -
                                                                                    Note: This bit is only valid when the
                                                                                    RX endpoint is operating in Bulk or
                                                                                    Interrupt mode. In ISO mode, it
                                                                                    always returns zero. */
#define USB_RXCSRL_OVERERROR_CLEAR               ((uint8_t)0x00000000U)          /* !< No over run or error condition. */
#define USB_RXCSRL_OVERERROR_SET                 ((uint8_t)0x00000004U)          /* !< Under run or error condition exist. */
/* USB_RXCSRL[DATAERRNAKTO] Bits */
#define USB_RXCSRL_DATAERRNAKTO_OFS              (3)                             /* !< DATAERRNAKTO Offset */
#define USB_RXCSRL_DATAERRNAKTO_MASK             ((uint8_t)0x00000008U)          /* !< Data Error / NAK Timeout Device
                                                                                    mode: Data Error - This bit is set
                                                                                    when RXRDY is set, if the data packet
                                                                                    has a CRC or bit-stuff error. It is
                                                                                    cleared when RXRDY is cleared. -
                                                                                    Note: This bit is only valid when the
                                                                                    endpoint is operating in ISO mode. In
                                                                                    Bulk mode, it always returns zero.
                                                                                    Host mode: NAK Timeout - When
                                                                                    operating in ISO mode, this bit is
                                                                                    set when RXRDY is set, if the data
                                                                                    packet has a CRC or bit-stuff error
                                                                                    and cleared when RXRDY is cleared. In
                                                                                    Bulk mode, this bit will be set when
                                                                                    the Rx endpoint is halted following
                                                                                    the receipt of NAK responses for
                                                                                    longer than the time set as the NAK
                                                                                    Limit by the USBRXINTERVAL register.
                                                                                    The CPU should clear this bit to
                                                                                    allow the endpoint to continue. */
#define USB_RXCSRL_DATAERRNAKTO_CLEAR            ((uint8_t)0x00000000U)          /* !< Normal operation */
#define USB_RXCSRL_DATAERRNAKTO_SET              ((uint8_t)0x00000008U)          /* !< Data error or NAK Timeout condition
                                                                                    exist. */
/* USB_RXCSRL[FLUSH] Bits */
#define USB_RXCSRL_FLUSH_OFS                     (4)                             /* !< FLUSH Offset */
#define USB_RXCSRL_FLUSH_MASK                    ((uint8_t)0x00000010U)          /* !< Flush FIFO. The CPU writes a 1 to
                                                                                    this bit to flush the next packet to
                                                                                    be read from the endpoint RX FIFO.
                                                                                    The FIFO pointer is reset and the
                                                                                    RXRDY bit is cleared.  Note: Thsi bit
                                                                                    should only be set when RXRDY is set.
                                                                                    At other times, it may cause data to
                                                                                    be corrupted.  Note: If the FIFO is
                                                                                    double-buffered, FLUSH may need to be
                                                                                    set twice to completely clear the
                                                                                    FIFO. Note: Device and host mode. */
#define USB_RXCSRL_FLUSH_NO_EFFECT               ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_RXCSRL_FLUSH_EFFECT                  ((uint8_t)0x00000010U)          /* !< Flushes the next packet to be read
                                                                                    from the endpoint receive FIFO. The
                                                                                    FIFO pointer is reset and the RXRDY
                                                                                    bit is cleared */
/* USB_RXCSRL[STALLREQPKT] Bits */
#define USB_RXCSRL_STALLREQPKT_OFS               (5)                             /* !< STALLREQPKT Offset */
#define USB_RXCSRL_STALLREQPKT_MASK              ((uint8_t)0x00000020U)          /* !< Send Stall / Request Packet. Device
                                                                                    mode: The CPU writes a 1 to this bit
                                                                                    to issue a STALL handshake. The CPU
                                                                                    clears this bit to terminate the
                                                                                    stall condition. - Note: This bit has
                                                                                    no effect where the endpoint is being
                                                                                    used for Isochronous transfers. Host
                                                                                    mode: The CPU writes a 1 to this bit
                                                                                    to request an IN transaction. It is
                                                                                    cleared when RXRDY is set. */
#define USB_RXCSRL_STALLREQPKT_CLEAR             ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_RXCSRL_STALLREQPKT_SET               ((uint8_t)0x00000020U)          /* !< Send stall or packet request. */
/* USB_RXCSRL[STALLED] Bits */
#define USB_RXCSRL_STALLED_OFS                   (6)                             /* !< STALLED Offset */
#define USB_RXCSRL_STALLED_MASK                  ((uint8_t)0x00000040U)          /* !< Sent Stall / RX Stall Device mode:
                                                                                    This bit is set when a STALL
                                                                                    handshake is transmitted. The CPU
                                                                                    should clear this bit. Host mode:
                                                                                    When a STALL handshake is received,
                                                                                    this bit is set and an interrupt is
                                                                                    generated. The CPU should clear this
                                                                                    bit. */
#define USB_RXCSRL_STALLED_STALLED_WAIT          ((uint8_t)0x00000000U)          /* !< No handshake has been received. */
#define USB_RXCSRL_STALLED_STALLED_RECEIVE       ((uint8_t)0x00000040U)          /* !< A STALL handshake has been
                                                                                    received. The EPn bit in the USBRXIS
                                                                                    register is also set. */
/* USB_RXCSRL[CLRDT] Bits */
#define USB_RXCSRL_CLRDT_OFS                     (7)                             /* !< CLRDT Offset */
#define USB_RXCSRL_CLRDT_MASK                    ((uint8_t)0x00000080U)          /* !< Clear Data Toggle. The CPU writes a
                                                                                    1 to this bit to reset the endpoint
                                                                                    data toggle to 0. Note: Device and
                                                                                    host mode. */
#define USB_RXCSRL_CLRDT_NO_EFFECT               ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_RXCSRL_CLRDT_EFFECT                  ((uint8_t)0x00000080U)          /* !< Writing a 1 to this bit clears the
                                                                                    DT bit in the USBRXCSRH[n] register. */

