MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_usb.h
/* USB_TXHUBADDR Bits */
/* USB_TXHUBADDR[ADDR] Bits */
#define USB_TXHUBADDR_ADDR_OFS                   (0)                             /* !< ADDR Offset */
#define USB_TXHUBADDR_ADDR_MASK                  ((uint8_t)0x0000007FU)          /* !< Device Address specifies the USB
                                                                                    bus address for the target Device. */
/* USB_TXHUBADDR[MULTTRAN] Bits */
#define USB_TXHUBADDR_MULTTRAN_OFS               (7)                             /* !< MULTTRAN Offset */
#define USB_TXHUBADDR_MULTTRAN_MASK              ((uint8_t)0x00000080U)          /* !< Record whether the hub has multiple
                                                                                    transaction translators. */
#define USB_TXHUBADDR_MULTTRAN_CLEAR             ((uint8_t)0x00000000U)          /* !< Clear to indicate that the hub has
                                                                                    a single transaction translator. */
#define USB_TXHUBADDR_MULTTRAN_SET               ((uint8_t)0x00000080U)          /* !< Set to indicate that the hub has
                                                                                    multiple transaction translators. */

/* USB_TXHUBPORT Bits */
/* USB_TXHUBPORT[ADDR] Bits */
#define USB_TXHUBPORT_ADDR_OFS                   (0)                             /* !< ADDR Offset */
#define USB_TXHUBPORT_ADDR_MASK                  ((uint8_t)0x0000007FU)          /* !< Hub Port specifies the USB hub port
                                                                                    number. */

/* USB_RXFUNCADDR Bits */
/* USB_RXFUNCADDR[ADDR] Bits */
#define USB_RXFUNCADDR_ADDR_OFS                  (0)                             /* !< ADDR Offset */
#define USB_RXFUNCADDR_ADDR_MASK                 ((uint8_t)0x0000007FU)          /* !< Device Address specifies the USB
                                                                                    bus address for the target Device. */

/* USB_RXHUBADDR Bits */
/* USB_RXHUBADDR[ADDR] Bits */
#define USB_RXHUBADDR_ADDR_OFS                   (0)                             /* !< ADDR Offset */
#define USB_RXHUBADDR_ADDR_MASK                  ((uint8_t)0x0000007FU)          /* !< Hub Address */
/* USB_RXHUBADDR[MULTTRAN] Bits */
#define USB_RXHUBADDR_MULTTRAN_OFS               (7)                             /* !< MULTTRAN Offset */
#define USB_RXHUBADDR_MULTTRAN_MASK              ((uint8_t)0x00000080U)          /* !< Record whether the hub has multiple
                                                                                    transaction translators. */
#define USB_RXHUBADDR_MULTTRAN_CLEAR             ((uint8_t)0x00000000U)          /* !< Clear to indicate that the hub has
                                                                                    a single transaction translator. */
#define USB_RXHUBADDR_MULTTRAN_SET               ((uint8_t)0x00000080U)          /* !< Set to indicate that the hub has
                                                                                    multiple transaction translators. */

/* USB_RXHUBPORT Bits */
/* USB_RXHUBPORT[ADDR] Bits */
#define USB_RXHUBPORT_ADDR_OFS                   (0)                             /* !< ADDR Offset */
#define USB_RXHUBPORT_ADDR_MASK                  ((uint8_t)0x0000007FU)          /* !< Hub Address */

/* USB_FADDR Bits */
/* USB_FADDR[FUNCADDR] Bits */
#define USB_FADDR_FUNCADDR_OFS                   (0)                             /* !< FUNCADDR Offset */
#define USB_FADDR_FUNCADDR_MASK                  ((uint8_t)0x0000007FU)          /* !< FAddr is an 8-bit register that
                                                                                    should be written with the 7-bit
                                                                                    address of the peripheral part of the
                                                                                    transaction. When the USB module is
                                                                                    being used in Peripheral mode
                                                                                    (DevCtl.D2=0), this register should
                                                                                    be written with the address received
                                                                                    through a SET_ADDRESS command, which
                                                                                    will then be used for decoding the
                                                                                    function address in subsequent token
                                                                                    packets. Notes: Peripheral Mode
                                                                                    Only!! */

/* USB_POWER Bits */
/* USB_POWER[ENSUSPENDM] Bits */
#define USB_POWER_ENSUSPENDM_OFS                 (0)                             /* !< ENSUSPENDM Offset */
#define USB_POWER_ENSUSPENDM_MASK                ((uint8_t)0x00000001U)          /* !< Set by the CPU to enable the
                                                                                    Suspend mode for the USB PHY. */
#define USB_POWER_ENSUSPENDM_DISABLE             ((uint8_t)0x00000000U)          /* !< USB PHY is powered */
#define USB_POWER_ENSUSPENDM_ENABLE              ((uint8_t)0x00000001U)          /* !< Powers down the internal USB PHY. */
/* USB_POWER[SUSPEND] Bits */
#define USB_POWER_SUSPEND_OFS                    (1)                             /* !< SUSPEND Offset */
#define USB_POWER_SUSPEND_MASK                   ((uint8_t)0x00000002U)          /* !< In Host mode, this bit is set by
                                                                                    the CPU to enter Suspend mode. In
                                                                                    Peripheral mode, this bit is set on
                                                                                    entry into Suspend mode. It is
                                                                                    cleared when the CPU reads the
                                                                                    interrupt register, or sets the
                                                                                    Resume bit. */
#define USB_POWER_SUSPEND_DISABLE                ((uint8_t)0x00000000U)          /* !< Ends SUSPEND signaling */
#define USB_POWER_SUSPEND_ENABLE                 ((uint8_t)0x00000002U)          /* !< Enables SUSPEND signaling */
/* USB_POWER[RESUME] Bits */
#define USB_POWER_RESUME_OFS                     (2)                             /* !< RESUME Offset */
#define USB_POWER_RESUME_MASK                    ((uint8_t)0x00000004U)          /* !< Set by the CPU to generate Resume
                                                                                    signaling when the device is in
                                                                                    Suspend mode.  In Peripheral mode,
                                                                                    the CPU should clear this bit after
                                                                                    10 ms (a maximum of 15 ms), to end
                                                                                    Resume signaling.  In Host mode, the
                                                                                    CPU should clear this bit after 20
                                                                                    ms. */
#define USB_POWER_RESUME_DISABLE                 ((uint8_t)0x00000000U)          /* !< Ends RESUME signaling on the bus. */
#define USB_POWER_RESUME_ENABLE                  ((uint8_t)0x00000004U)          /* !< Enables RESUME signaling when the
                                                                                    Device is in SUSPEND mode. */
/* USB_POWER[RESET] Bits */
#define USB_POWER_RESET_OFS                      (3)                             /* !< RESET Offset */
#define USB_POWER_RESET_MASK                     ((uint8_t)0x00000008U)          /* !< This bit is set when Reset
                                                                                    signaling is present on the bus.
                                                                                    Note: This bit is Read/Write from the
                                                                                    CPU in Host Mode but Read-Only in
                                                                                    Peripheral Mode. */
#define USB_POWER_RESET_DISABLE                  ((uint8_t)0x00000000U)          /* !< Ends RESET signaling on the bus. */
#define USB_POWER_RESET_ENABLE                   ((uint8_t)0x00000008U)          /* !< Enables RESET signaling on the bus. */
/* USB_POWER[SOFT_CONN] Bits */
#define USB_POWER_SOFT_CONN_OFS                  (6)                             /* !< SOFT_CONN Offset */
#define USB_POWER_SOFT_CONN_MASK                 ((uint8_t)0x00000040U)          /* !< Soft Connect/Disconnect feature.
                                                                                    The USB D+/D- lines are enabled when
                                                                                    this bit is set by the CPU and
                                                                                    tri-stated when this bit is cleared
                                                                                    by the CPU.  Note: Only valid in
                                                                                    Peripheral Mode. */
#define USB_POWER_SOFT_CONN_TRISTATE             ((uint8_t)0x00000000U)          /* !< The USB D+/D- lines are tri-stated. */
#define USB_POWER_SOFT_CONN_ENABLE               ((uint8_t)0x00000040U)          /* !< The USB D+/D- lines are enabled. */
/* USB_POWER[ISOUP] Bits */
#define USB_POWER_ISOUP_OFS                      (7)                             /* !< ISOUP Offset */
#define USB_POWER_ISOUP_MASK                     ((uint8_t)0x00000080U)          /* !< Isochronous Up2025-10-01. When set by the
                                                                                    CPU, the USB module will wait for an
                                                                                    SOF token from the time TXRDY bit is
                                                                                    set in the USBTXCSRLn before sending
                                                                                    the packet. If an IN token is
                                                                                    received before an SOF token, then a
                                                                                    zero length data packet will be sent.
                                                                                    Note: Only valid in Peripheral Mode.
                                                                                    Also, this bit only affects endpoints
                                                                                    performing Isochronous transfers. */
#define USB_POWER_ISOUP_NO_EFFECT                ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_POWER_ISOUP_WAIT_SOF                 ((uint8_t)0x00000080U)          /* !< The USB controller waits for an SOF
                                                                                    token. */

/* USB_TXIS Bits */
/* USB_TXIS[EP0] Bits */
#define USB_TXIS_EP0_OFS                         (0)                             /* !< EP0 Offset */
#define USB_TXIS_EP0_MASK                        ((uint16_t)0x00000001U)         /* !< Transmit Endpoint 0 Interrupt */
#define USB_TXIS_EP0_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP0_INT                         ((uint16_t)0x00000001U)         /* !< The Endpoint 0 transmit and receive
                                                                                    interrupt is asserted. */
/* USB_TXIS[EP1] Bits */
#define USB_TXIS_EP1_OFS                         (1)                             /* !< EP1 Offset */
#define USB_TXIS_EP1_MASK                        ((uint16_t)0x00000002U)         /* !< Transmit Endpoint 1 Interrupt */
#define USB_TXIS_EP1_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP1_INT                         ((uint16_t)0x00000002U)         /* !< The Endpoint 1 transmit interrupt
                                                                                    is asserted. */
/* USB_TXIS[EP2] Bits */
#define USB_TXIS_EP2_OFS                         (2)                             /* !< EP2 Offset */
#define USB_TXIS_EP2_MASK                        ((uint16_t)0x00000004U)         /* !< Transmit Endpoint 2 Interrupt */
#define USB_TXIS_EP2_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP2_INT                         ((uint16_t)0x00000004U)         /* !< The Endpoint 2 transmit interrupt
                                                                                    is asserted. */
/* USB_TXIS[EP3] Bits */
#define USB_TXIS_EP3_OFS                         (3)                             /* !< EP3 Offset */
#define USB_TXIS_EP3_MASK                        ((uint16_t)0x00000008U)         /* !< Transmit Endpoint 3 Interrupt */
#define USB_TXIS_EP3_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP3_INT                         ((uint16_t)0x00000008U)         /* !< The Endpoint 3 transmit interrupt
                                                                                    is asserted. */
/* USB_TXIS[EP4] Bits */
#define USB_TXIS_EP4_OFS                         (4)                             /* !< EP4 Offset */
#define USB_TXIS_EP4_MASK                        ((uint16_t)0x00000010U)         /* !< Transmit Endpoint 4 Interrupt */
#define USB_TXIS_EP4_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP4_INT                         ((uint16_t)0x00000010U)         /* !< The Endpoint 4 transmit interrupt
                                                                                    is asserted. */
/* USB_TXIS[EP5] Bits */
#define USB_TXIS_EP5_OFS                         (5)                             /* !< EP5 Offset */
#define USB_TXIS_EP5_MASK                        ((uint16_t)0x00000020U)         /* !< Transmit Endpoint 5 Interrupt */
#define USB_TXIS_EP5_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP5_INT                         ((uint16_t)0x00000020U)         /* !< The Endpoint 5 transmit interrupt
                                                                                    is asserted. */
/* USB_TXIS[EP6] Bits */
#define USB_TXIS_EP6_OFS                         (6)                             /* !< EP6 Offset */
#define USB_TXIS_EP6_MASK                        ((uint16_t)0x00000040U)         /* !< Transmit Endpoint 6 Interrupt */
#define USB_TXIS_EP6_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP6_INT                         ((uint16_t)0x00000040U)         /* !< The Endpoint 6 transmit interrupt
                                                                                    is asserted. */
/* USB_TXIS[EP7] Bits */
#define USB_TXIS_EP7_OFS                         (7)                             /* !< EP7 Offset */
#define USB_TXIS_EP7_MASK                        ((uint16_t)0x00000080U)         /* !< Transmit Endpoint 7 Interrupt */
#define USB_TXIS_EP7_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_TXIS_EP7_INT                         ((uint16_t)0x00000080U)         /* !< The Endpoint 7 transmit interrupt
                                                                                    is asserted. */

/* USB_RXIS Bits */
/* USB_RXIS[EP1] Bits */
#define USB_RXIS_EP1_OFS                         (1)                             /* !< EP1 Offset */
#define USB_RXIS_EP1_MASK                        ((uint16_t)0x00000002U)         /* !< Recieve Endpoint 1 Interrupt */
#define USB_RXIS_EP1_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIS_EP1_INT                         ((uint16_t)0x00000002U)         /* !< The Endpoint 1 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIS[EP2] Bits */
#define USB_RXIS_EP2_OFS                         (2)                             /* !< EP2 Offset */
#define USB_RXIS_EP2_MASK                        ((uint16_t)0x00000004U)         /* !< Recieve Endpoint 2 Interrupt */
#define USB_RXIS_EP2_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIS_EP2_INT                         ((uint16_t)0x00000004U)         /* !< The Endpoint 2 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIS[EP3] Bits */
#define USB_RXIS_EP3_OFS                         (3)                             /* !< EP3 Offset */
#define USB_RXIS_EP3_MASK                        ((uint16_t)0x00000008U)         /* !< Recieve Endpoint 3 Interrupt */
#define USB_RXIS_EP3_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIS_EP3_INT                         ((uint16_t)0x00000008U)         /* !< The Endpoint 3 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIS[EP4] Bits */
#define USB_RXIS_EP4_OFS                         (4)                             /* !< EP4 Offset */
#define USB_RXIS_EP4_MASK                        ((uint16_t)0x00000010U)         /* !< Recieve Endpoint 4 Interrupt */
#define USB_RXIS_EP4_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIS_EP4_INT                         ((uint16_t)0x00000010U)         /* !< The Endpoint 4 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIS[EP5] Bits */
#define USB_RXIS_EP5_OFS                         (5)                             /* !< EP5 Offset */
#define USB_RXIS_EP5_MASK                        ((uint16_t)0x00000020U)         /* !< Recieve Endpoint 5 Interrupt */
#define USB_RXIS_EP5_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIS_EP5_INT                         ((uint16_t)0x00000020U)         /* !< The Endpoint 5 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIS[EP6] Bits */
#define USB_RXIS_EP6_OFS                         (6)                             /* !< EP6 Offset */
#define USB_RXIS_EP6_MASK                        ((uint16_t)0x00000040U)         /* !< Recieve Endpoint 6 Interrupt */
#define USB_RXIS_EP6_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIS_EP6_INT                         ((uint16_t)0x00000040U)         /* !< The Endpoint 6 transmit interrupt
                                                                                    is asserted. */
/* USB_RXIS[EP7] Bits */
#define USB_RXIS_EP7_OFS                         (7)                             /* !< EP7 Offset */
#define USB_RXIS_EP7_MASK                        ((uint16_t)0x00000080U)         /* !< Recieve Endpoint 7 Interrupt */
#define USB_RXIS_EP7_NO_INT                      ((uint16_t)0x00000000U)         /* !< No interrupt */
#define USB_RXIS_EP7_INT                         ((uint16_t)0x00000080U)         /* !< The Endpoint 7 transmit interrupt
                                                                                    is asserted. */

