MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_usb.h
#define USB_IDXRXFIFOADD_ADDR_ADDR_1888          ((uint16_t)0x000000ECU)         /* !< 1888.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1896          ((uint16_t)0x000000EDU)         /* !< 1896.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1904          ((uint16_t)0x000000EEU)         /* !< 1904.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1912          ((uint16_t)0x000000EFU)         /* !< 1912.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1920          ((uint16_t)0x000000F0U)         /* !< 1920.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1928          ((uint16_t)0x000000F1U)         /* !< 1928.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1936          ((uint16_t)0x000000F2U)         /* !< 1936.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1944          ((uint16_t)0x000000F3U)         /* !< 1944.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1952          ((uint16_t)0x000000F4U)         /* !< 1952.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1960          ((uint16_t)0x000000F5U)         /* !< 1960.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1968          ((uint16_t)0x000000F6U)         /* !< 1968.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1976          ((uint16_t)0x000000F7U)         /* !< 1976.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1984          ((uint16_t)0x000000F8U)         /* !< 1984.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_1992          ((uint16_t)0x000000F9U)         /* !< 1992.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_2000          ((uint16_t)0x000000FAU)         /* !< 2000.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_2008          ((uint16_t)0x000000FBU)         /* !< 2008.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_2016          ((uint16_t)0x000000FCU)         /* !< 2016.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_2024          ((uint16_t)0x000000FDU)         /* !< 2024.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_2032          ((uint16_t)0x000000FEU)         /* !< 2032.0 */
#define USB_IDXRXFIFOADD_ADDR_ADDR_2040          ((uint16_t)0x000000FFU)         /* !< 2040.0 */

/* USB_EPINFO Bits */
/* USB_EPINFO[TXENDPOINTS] Bits */
#define USB_EPINFO_TXENDPOINTS_OFS               (0)                             /* !< TXENDPOINTS Offset */
#define USB_EPINFO_TXENDPOINTS_MASK              ((uint8_t)0x0000000FU)          /* !< The number of TX endpoints
                                                                                    implemented in the design. */
/* USB_EPINFO[RXENDPOINTS] Bits */
#define USB_EPINFO_RXENDPOINTS_OFS               (4)                             /* !< RXENDPOINTS Offset */
#define USB_EPINFO_RXENDPOINTS_MASK              ((uint8_t)0x000000F0U)          /* !< The number of Rx endpoints
                                                                                    implemented in the design. */

/* USB_RAMINFO Bits */
/* USB_RAMINFO[RAMBITS] Bits */
#define USB_RAMINFO_RAMBITS_OFS                  (0)                             /* !< RAMBITS Offset */
#define USB_RAMINFO_RAMBITS_MASK                 ((uint8_t)0x0000000FU)          /* !< The width of the RAM address bus. */
#define USB_RAMINFO_RAMBITS_RAM_1KB              ((uint8_t)0x00000008U)          /* !< USB FIFO RAM size is 1kB */
#define USB_RAMINFO_RAMBITS_RAM_2KB              ((uint8_t)0x00000009U)          /* !< USB FIFO RAM size is 2kB */
#define USB_RAMINFO_RAMBITS_RAM_4KB              ((uint8_t)0x0000000AU)          /* !< USB FIFO RAM size is 4kB */

/* USB_CONTIM Bits */
/* USB_CONTIM[WTID] Bits */
#define USB_CONTIM_WTID_OFS                      (0)                             /* !< WTID Offset */
#define USB_CONTIM_WTID_MASK                     ((uint8_t)0x0000000FU)          /* !< The wait ID field configures the
                                                                                    delay required from the enable of the
                                                                                    ID detection to when the ID value is
                                                                                    valid, in units of 4.369 ms. Note:
                                                                                    The default corresponds to 52.43 ms. */
/* USB_CONTIM[WTCON] Bits */
#define USB_CONTIM_WTCON_OFS                     (4)                             /* !< WTCON Offset */
#define USB_CONTIM_WTCON_MASK                    ((uint8_t)0x000000F0U)          /* !< The connect wait field configures
                                                                                    the wait required to allow for the
                                                                                    user's connect/disconnect filter, in
                                                                                    units of 533.3 ns. Note: The default
                                                                                    corresponds to 2.667 us. */

/* USB_FSEOF Bits */
/* USB_FSEOF[FSEOFG] Bits */
#define USB_FSEOF_FSEOFG_OFS                     (0)                             /* !< FSEOFG Offset */
#define USB_FSEOF_FSEOFG_MASK                    ((uint8_t)0x000000FFU)          /* !< The full-speed end-of-frame gap
                                                                                    field is used during full-speed
                                                                                    transactions to configure the gap
                                                                                    between the last transaction and the
                                                                                    End-of-Frame (EOF), in units of 533.3
                                                                                    ns.  Note: The default corresponds to
                                                                                    63.46 us. */

/* USB_LSEOF Bits */
/* USB_LSEOF[LSEOFG] Bits */
#define USB_LSEOF_LSEOFG_OFS                     (0)                             /* !< LSEOFG Offset */
#define USB_LSEOF_LSEOFG_MASK                    ((uint8_t)0x000000FFU)          /* !< The low-speed end-of-frame gap
                                                                                    field is used during low-speed
                                                                                    transactions to set the gap between
                                                                                    the last transaction and the
                                                                                    End-of-Frame (EOF), in units of 1.067
                                                                                    us. Note: The default corresponds to
                                                                                    121.6 us. */

