MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0c1/thirdparty/mspm0c1/ti/devices/msp/peripherals/hw_usb.h
/* USB_ICLR Bits */
/* USB_ICLR[INTRTX] Bits */
#define USB_ICLR_INTRTX_OFS                      (0)                             /* !< INTRTX Offset */
#define USB_ICLR_INTRTX_MASK                     ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USB_ICLR_INTRTX_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_INTRTX_CLR                      ((uint32_t)0x00000001U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[INTRRX] Bits */
#define USB_ICLR_INTRRX_OFS                      (1)                             /* !< INTRRX Offset */
#define USB_ICLR_INTRRX_MASK                     ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USB_ICLR_INTRRX_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_INTRRX_CLR                      ((uint32_t)0x00000002U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[INTRUSB] Bits */
#define USB_ICLR_INTRUSB_OFS                     (2)                             /* !< INTRUSB Offset */
#define USB_ICLR_INTRUSB_MASK                    ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USB_ICLR_INTRUSB_NO_EFFECT               ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_INTRUSB_CLR                     ((uint32_t)0x00000004U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[VUSBPWRDN] Bits */
#define USB_ICLR_VUSBPWRDN_OFS                   (3)                             /* !< VUSBPWRDN Offset */
#define USB_ICLR_VUSBPWRDN_MASK                  ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USB_ICLR_VUSBPWRDN_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_VUSBPWRDN_CLR                   ((uint32_t)0x00000008U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONEARX] Bits */
#define USB_ICLR_DMADONEARX_OFS                  (4)                             /* !< DMADONEARX Offset */
#define USB_ICLR_DMADONEARX_MASK                 ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_ICLR_DMADONEARX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONEARX_CLR                  ((uint32_t)0x00000010U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONEATX] Bits */
#define USB_ICLR_DMADONEATX_OFS                  (5)                             /* !< DMADONEATX Offset */
#define USB_ICLR_DMADONEATX_MASK                 ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_ICLR_DMADONEATX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONEATX_CLR                  ((uint32_t)0x00000020U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONEBRX] Bits */
#define USB_ICLR_DMADONEBRX_OFS                  (6)                             /* !< DMADONEBRX Offset */
#define USB_ICLR_DMADONEBRX_MASK                 ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_ICLR_DMADONEBRX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONEBRX_CLR                  ((uint32_t)0x00000040U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONEBTX] Bits */
#define USB_ICLR_DMADONEBTX_OFS                  (7)                             /* !< DMADONEBTX Offset */
#define USB_ICLR_DMADONEBTX_MASK                 ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_ICLR_DMADONEBTX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONEBTX_CLR                  ((uint32_t)0x00000080U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONECRX] Bits */
#define USB_ICLR_DMADONECRX_OFS                  (8)                             /* !< DMADONECRX Offset */
#define USB_ICLR_DMADONECRX_MASK                 ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_ICLR_DMADONECRX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONECRX_CLR                  ((uint32_t)0x00000100U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONECTX] Bits */
#define USB_ICLR_DMADONECTX_OFS                  (9)                             /* !< DMADONECTX Offset */
#define USB_ICLR_DMADONECTX_MASK                 ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_ICLR_DMADONECTX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONECTX_CLR                  ((uint32_t)0x00000200U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONEDRX] Bits */
#define USB_ICLR_DMADONEDRX_OFS                  (10)                            /* !< DMADONEDRX Offset */
#define USB_ICLR_DMADONEDRX_MASK                 ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_ICLR_DMADONEDRX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONEDRX_CLR                  ((uint32_t)0x00000400U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMADONEDTX] Bits */
#define USB_ICLR_DMADONEDTX_OFS                  (11)                            /* !< DMADONEDTX Offset */
#define USB_ICLR_DMADONEDTX_MASK                 ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_ICLR_DMADONEDTX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMADONEDTX_CLR                  ((uint32_t)0x00000800U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPREARX] Bits */
#define USB_ICLR_DMAPREARX_OFS                   (12)                            /* !< DMAPREARX Offset */
#define USB_ICLR_DMAPREARX_MASK                  ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_ICLR_DMAPREARX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPREARX_CLR                   ((uint32_t)0x00001000U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPREATX] Bits */
#define USB_ICLR_DMAPREATX_OFS                   (13)                            /* !< DMAPREATX Offset */
#define USB_ICLR_DMAPREATX_MASK                  ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_ICLR_DMAPREATX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPREATX_CLR                   ((uint32_t)0x00002000U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPREBRX] Bits */
#define USB_ICLR_DMAPREBRX_OFS                   (14)                            /* !< DMAPREBRX Offset */
#define USB_ICLR_DMAPREBRX_MASK                  ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_ICLR_DMAPREBRX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPREBRX_CLR                   ((uint32_t)0x00004000U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPREBTX] Bits */
#define USB_ICLR_DMAPREBTX_OFS                   (15)                            /* !< DMAPREBTX Offset */
#define USB_ICLR_DMAPREBTX_MASK                  ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_ICLR_DMAPREBTX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPREBTX_CLR                   ((uint32_t)0x00008000U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPRECRX] Bits */
#define USB_ICLR_DMAPRECRX_OFS                   (16)                            /* !< DMAPRECRX Offset */
#define USB_ICLR_DMAPRECRX_MASK                  ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_ICLR_DMAPRECRX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPRECRX_CLR                   ((uint32_t)0x00010000U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPRECTX] Bits */
#define USB_ICLR_DMAPRECTX_OFS                   (17)                            /* !< DMAPRECTX Offset */
#define USB_ICLR_DMAPRECTX_MASK                  ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_ICLR_DMAPRECTX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPRECTX_CLR                   ((uint32_t)0x00020000U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPREDRX] Bits */
#define USB_ICLR_DMAPREDRX_OFS                   (18)                            /* !< DMAPREDRX Offset */
#define USB_ICLR_DMAPREDRX_MASK                  ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_ICLR_DMAPREDRX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPREDRX_CLR                   ((uint32_t)0x00040000U)         /* !< Write 1 to clear the interrupt */
/* USB_ICLR[DMAPREDTX] Bits */
#define USB_ICLR_DMAPREDTX_OFS                   (19)                            /* !< DMAPREDTX Offset */
#define USB_ICLR_DMAPREDTX_MASK                  ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_ICLR_DMAPREDTX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ICLR_DMAPREDTX_CLR                   ((uint32_t)0x00080000U)         /* !< Write 1 to clear the interrupt */

/* USB_PWREN Bits */
/* USB_PWREN[ENABLE] Bits */
#define USB_PWREN_ENABLE_OFS                     (0)                             /* !< ENABLE Offset */
#define USB_PWREN_ENABLE_MASK                    ((uint32_t)0x00000001U)         /* !< Enable the power */
#define USB_PWREN_ENABLE_DISABLE                 ((uint32_t)0x00000000U)         /* !< Disable Power */
#define USB_PWREN_ENABLE_ENABLE                  ((uint32_t)0x00000001U)         /* !< Enable Power */
/* USB_PWREN[KEY] Bits */
#define USB_PWREN_KEY_OFS                        (24)                            /* !< KEY Offset */
#define USB_PWREN_KEY_MASK                       ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define USB_PWREN_KEY_UNLOCK_W                   ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* USB_RSTCTL Bits */
/* USB_RSTCTL[RESETSTKYCLR] Bits */
#define USB_RSTCTL_RESETSTKYCLR_OFS              (1)                             /* !< RESETSTKYCLR Offset */
#define USB_RSTCTL_RESETSTKYCLR_MASK             ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define USB_RSTCTL_RESETSTKYCLR_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define USB_RSTCTL_RESETSTKYCLR_CLR              ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* USB_RSTCTL[RESETASSERT] Bits */
#define USB_RSTCTL_RESETASSERT_OFS               (0)                             /* !< RESETASSERT Offset */
#define USB_RSTCTL_RESETASSERT_MASK              ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define USB_RSTCTL_RESETASSERT_NOP               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define USB_RSTCTL_RESETASSERT_ASSERT            ((uint32_t)0x00000001U)         /* !< Assert reset */
/* USB_RSTCTL[KEY] Bits */
#define USB_RSTCTL_KEY_OFS                       (24)                            /* !< KEY Offset */
#define USB_RSTCTL_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define USB_RSTCTL_KEY_UNLOCK_W                  ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* USB_CLKCTL Bits */
/* USB_CLKCTL[CLKDIV] Bits */
#define USB_CLKCTL_CLKDIV_OFS                    (0)                             /* !< CLKDIV Offset */
#define USB_CLKCTL_CLKDIV_MASK                   ((uint32_t)0x0000000FU)         /* !< Divider settings for the functional
                                                                                    clock */
#define USB_CLKCTL_CLKDIV_DIV_BY_1               ((uint32_t)0x00000000U)         /* !< Divide by 1 */
#define USB_CLKCTL_CLKDIV_DIV_BY_2               ((uint32_t)0x00000001U)         /* !< Divide by 2 */
#define USB_CLKCTL_CLKDIV_DIV_BY_3               ((uint32_t)0x00000002U)         /* !< Divide by 3 */
#define USB_CLKCTL_CLKDIV_DIV_BY_4               ((uint32_t)0x00000003U)         /* !< Divide by 4 */
#define USB_CLKCTL_CLKDIV_DIV_BY_5               ((uint32_t)0x00000004U)         /* !< Divide by 5 */
#define USB_CLKCTL_CLKDIV_DIV_BY_6               ((uint32_t)0x00000005U)         /* !< Divide by 6 */
#define USB_CLKCTL_CLKDIV_DIV_BY_10              ((uint32_t)0x00000006U)         /* !< Divide by 10 */
#define USB_CLKCTL_CLKDIV_DIV_BY_12              ((uint32_t)0x00000007U)         /* !< Divide by 12 */
#define USB_CLKCTL_CLKDIV_DIV_BY_15              ((uint32_t)0x00000008U)         /* !< Divide by 15 */
#define USB_CLKCTL_CLKDIV_DIV_BY_20              ((uint32_t)0x00000009U)         /* !< Divide by 20 */
#define USB_CLKCTL_CLKDIV_DIV_BY_30              ((uint32_t)0x0000000AU)         /* !< Divide by 30 */
#define USB_CLKCTL_CLKDIV_DIV_BY_60              ((uint32_t)0x0000000BU)         /* !< Divide by 60 */

/* USB_STAT Bits */
/* USB_STAT[ENABLE] Bits */
#define USB_STAT_ENABLE_OFS                      (8)                             /* !< ENABLE Offset */
#define USB_STAT_ENABLE_MASK                     ((uint32_t)0x00000100U)         /* !< Peripheral enable status */
#define USB_STAT_ENABLE_OFF                      ((uint32_t)0x00000000U)         /* !< Peripheral is disabled */
#define USB_STAT_ENABLE_ON                       ((uint32_t)0x00000100U)         /* !< Peripheral is enabled */
/* USB_STAT[RESETSTKY] Bits */
#define USB_STAT_RESETSTKY_OFS                   (16)                            /* !< RESETSTKY Offset */
#define USB_STAT_RESETSTKY_MASK                  ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define USB_STAT_RESETSTKY_NORES                 ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define USB_STAT_RESETSTKY_RESET                 ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */
/* USB_STAT[SWENABLE] Bits */
#define USB_STAT_SWENABLE_OFS                    (0)                             /* !< SWENABLE Offset */
#define USB_STAT_SWENABLE_MASK                   ((uint32_t)0x00000001U)         /* !< Software enable status. Shows if
                                                                                    enabled via PWREN.ENABLE bit */
#define USB_STAT_SWENABLE_DISABLED               ((uint32_t)0x00000000U)         /* !< Not enabled via PWREN.ENABLE bit */
#define USB_STAT_SWENABLE_ENABLED                ((uint32_t)0x00000001U)         /* !< Enabled via PWREN.ENABLE bit */

